{
  "localization": {
    "currentLanguage": "DE"
  },
  "header": {
    "cv": "./EN-Burkay.pdf",
    "about": "Über Mich",
    "work": "Projekte",
    "testimonials": "Referenzen",
    "contact": "Kontakt",
    "lightMode": "Heller Modus",
    "darkMode":  "Dunkler Modus",
    "language": "Sprache",
    "download-cv": "Lebenslauf",
    "download-cv-mobile": "Lebenslauf",
    "close": "Schließen"
  },
  "introduction": {
    "title": "Hallo, ich bin Burkay 👋",
    "text": "Ich bin ein Elektro- und Elektronikingenieur, der leidenschaftlich gerne technologische Lösungen entwickelt und stets nach kontinuierlicher Weiterentwicklung strebt. Ich beherrsche die Technologien JavaScript, TypeScript, React, Next.js, C# und C++. Durch internationale Erfahrungen habe ich Flexibilität gewonnen und verfüge über Fachwissen in webbasierten SCADA-Automatisierungssystemen sowie in der Spieleentwicklung. In meinem Abschlussprojekt arbeitete ich an einer plattformübergreifenden E-Commerce-Anwendung mit React und Kotlin. Zu meinen Hobbys gehören das Verfolgen aktueller Technologie- und Gaming-Trends sowie lange Spaziergänge.",
    "location": "Eskişehir, Türkei",
    "availability": "Verfügbar für neue Möglichkeiten"
  },
  "aboutMe": {
    "pageTitle": "Über mich",
    "title": "Neugierig auf mich? Hier erfährst du mehr:",

    "text1": "Ich bin Absolvent der Elektrotechnik und Elektronik und starte gerade richtig in die Welt der Softwareentwicklung. Meine Reise begann mit einer Begeisterung für Spiele und wurde durch Praktika in einem Game Studio und einem Web-SCADA-Unternehmen noch verstärkt. Diese Kombination hat mir beigebracht, kreativ zu denken und gleichzeitig robuste Systeme zu bauen – und ich habe es geliebt.",
    "text2": "Ich spezialisiere mich auf moderne Frontend-Entwicklung mit React, Next.js, TypeScript und Tailwind CSS. Zusätzlich bringe ich Erfahrung mit Unity und C# mit, was mir ein gutes Gespür für Design und Interaktivität verleiht. Mein Fokus liegt auf benutzerfreundlichen, zugänglichen und performanten Web-Erlebnissen.",
    "text3": "Ich bin lernfreudig, neugierig und begleite Projekte gerne von der ersten Idee bis zum fertigen Produkt. Ob beim Coden von Komponenten, dem Beheben von Bugs oder dem Eintauchen in neue Tools – ich bin mit Begeisterung dabei.",
    "text4": "Wenn ich gerade mal nicht codiere, optimiere ich meine Städte in Cities: Skylines, schaue Game-Dev-Videos oder informiere mich über neue Trends im Frontend-Bereich. Man findet mich auch gerne mal auf GitHub oder beim Sammeln von Design-Inspirationen für “später”.",

    "li1": "Absolvent in Elektrotechnik",
    "li2": "Praktika in Game Development & Industrie-Software",
    "li3": "Offen für Junior-Frontend-Rollen – und für Neues",
    "li4": "Verfügbar für Freelance und Festanstellung",

    "text5": "Ich freue mich, von dir zu hören – ob für ein Projekt oder einfach so zum Austauschen! 😉"
  },
  "skills": {
    "pageTitle": "Fähigkeiten",
    "pageContent": "Die Fähigkeiten, Tools und Technologien, die ich verwende:"
  },
  "experience": {
    "pageTitle": "Erfahrung",
    "pageContent": "Hier ist eine kurze Zusammenfassung meiner Erfahrungen:",

    "iotech title": "Frontend-Entwickler",
    "iotech organization": "IOTech Software",
    "iotech li1": "Ich habe Module zur Komponentenvisualisierung für eine weit verbreitete Web-SCADA-Software entwickelt.",
    "iotech li2": "Ich habe verschiedene F&E-Projekte mit modernen Technologien wie Next.js, TypeScript, Zustand und Auth.js entwickelt.",
    "iotech date": "Feb 2025 – Heute",

    "devnet title": "Praktikant im Bereich Spieleentwicklung",
    "devnet organization": "Devnet Technologie",
    "devnet li1": "Ich habe Spiele für die Android-Plattform mit Unity und C# in Genres wie Roguelike Shooter und Hypercasual entwickelt.",
    "devnet date": "Jul 2024 - Sep 2024",

    "rgr title": "Koordinator für Marketing und Sponsoring",
    "rgr organization": "Red Giant Rover Team der Technischen Universität Konya",
    "rgr li1": "Im Jahr 2021 erreichten wir den dritten Platz bei der European Rover Challenge, einem der renommiertesten Robotikwettbewerbe Europas.",
    "rgr li2": "Ich leitete Promotion- und Sponsoringaktivitäten und trug zur Erstellung von Berichten und Dokumenten für Wettbewerbe bei.",
    "rgr li3": "Als Mitglied eines hochprofessionellen Teams habe ich meine Fähigkeiten zur kooperativen Teamarbeit deutlich verbessert.",
    "rgr date": "Feb 2021 - Sep 2023",

    "gikat title": "Vorstandsmitglied und stellvertretender Vorsitzender",
    "gikat organization": "Selçuk Universität – Verein für Unternehmertum und Karriere",
    "gikat li1": "Ich leitete erfolgreiche Projekte in den Bereichen Forschung & Entwicklung, Marketing und Organisation.",
    "gikat li2": "Ich verhandelte Geschäftsvereinbarungen mit Unternehmen wie Atiker, Altınyıldız und QNB Finansbank.",
    "gikat li3": "Ich habe sowohl Großveranstaltungen mit 1000 Teilnehmern als auch kleinere Events mit 50 Teilnehmern geplant und geleitet.",
    "gikat date": "Okt 2021 - Jan 2023"
  },
  "education": {
  "pageTitle": "Ausbildung",

  "educationTitle1": "Selcuk Universität",
  "su organization": "Bachelorstudium, Elektrotechnik und Elektronik",
  "educationLi1": "Ehrenurkunde und Fachbereichsbeste in den akademischen Jahren 2021 und 2022",
  "educationDate1": "Sep 2021 - Jun 2025",

  "educationTitle2": "Università degli Studi di Palermo",
  "up organization": "Bachelorstudium, Informationstechnologie",
  "educationLi2": "Erasmus+ Studienaufenthalt in Palermo, Italien",
  "educationDate2": "Feb 2023 - Aug 2023"
},
  "work": {
    "pageTitle": "Projekte",
    "pageContent": "Einige bemerkenswerte Projekte, die ich umgesetzt habe:",

    "workTitle1": "Golet E-Commerce-Plattform",
    "workText1": "Als Abschlussprojekt habe ich zur Entwicklung einer auf Firebase basierenden E-Commerce-Plattform beigetragen, die sowohl mit Web als auch mit mobilen Geräten kompatibel ist und mit React und Kotlin umgesetzt wurde. Diese Plattform vereint Elemente von Amazon und Letgo.",

    "workTitle2": "Web-SCADA-Komponentenvisualisierung",
    "workText2": "Ich habe ein Web-SCADA-Modul entwickelt, das die allgemeinen Komponentendateien aus der Desktop-SCADA-Software mit den über SignalR vom Server empfangenen Echtzeitdaten zusammenführt, aufbereitet und entsprechend visualisiert.",

    "workTitle3": "Spieleentwicklung mit Unity",
    "workText3": "Ich habe Spiele für Android-Plattformen mit Unity und C# entwickelt, unter anderem in den Genres Roguelike Shooter und Hypercasual. Eines davon ist Treasure Wizard, inspiriert von Vampire Survivors."
  },
  "testimonials": {
    "pageTitle": "Referenzen",
    "pageContent": "Nette Dinge, die Menschen über mich gesagt haben:",

    "testimonialText1": "„Als eine selbstmotivierte, lösungsorientierte Person mit ausgeprägten Kommunikationsfähigkeiten bin ich überzeugt, dass sie in Zukunft große Erfolge im Softwarebereich erzielen wird. Die Zusammenarbeit mit ihr war eine Freude, und ich wünsche ihr viel Erfolg für ihre weitere Karriere.“",
    "testimonialPerson1": "Hamza Barış Doğan",
    "testimonialTitle1": "Senioringenieur - IOTech",
    "testimonialLink1": "https://www.linkedin.com/in/hamza-barış-doğan-410922165/",

    "testimonialText2": "„Dank seines unternehmerischen Geistes, seiner projektorientierten Arbeitsdisziplin und seines Interesses an Technologien hat er sich während seines Studentenlebens hervorgetan. Als sein akademischer Berater empfehle ich ihn mit bestem Gewissen.“",
    "testimonialPerson2": "Hasan Erdinc Kocer",
    "testimonialTitle2": "Dekan der Fakultät für Technologie, Selçuk Universität",
    "testimonialLink2": "https://www.linkedin.com/in/hasan-erdinc-kocer-43884533/",

    "testimonialText3": "„Toller Typ, absolut empfehlenswert für jede KOMPLEXE Frontend-Entwicklungsarbeit! Seine Fähigkeiten sind erstklassig und er ist eine große Bereicherung für jedes Team.“",
    "testimonialPerson3": "Burak Kılıç",
    "testimonialTitle3": "Frontend-Entwickler – IOTech",
    "testimonialLink3": "https://www.linkedin.com/in/burakkilic2/",

    "testimonialText4": "“Die Zusammenarbeit mit Burkay war eine echte Bereicherung. Er verfügt über eine seltene Fähigkeit, Systeme ganzheitlich zu betrachten und zu verstehen, wie die einzelnen Teile im großen Ganzen zusammenwirken. Zudem beeindruckte mich Burkay stets durch seine gründliche Recherche und seine ausgezeichneten Problemlösungsfähigkeiten, mit denen er wohlüberlegte und fundierte Beiträge leistete. Er wird für jedes Team eine große Bereicherung sein.”",
    "testimonialPerson4": "Abdurahmaan Yuusuf",
    "testimonialTitle4": "F&E-Teamleiter – IOTech",
    "testimonialLink4": "https://www.linkedin.com/in/abdurahmaan-yuusuf-6512a8321/",

    "testimonialText5": "Burkay war während seines Praktikums eine fantastische Bereicherung für unser Team. Er hat sich schnell in unseren Tech-Stack eingearbeitet, sauberen und zuverlässigen Code geliefert und starke Problemlösungsfähigkeiten gezeigt. Seine positive Einstellung, Offenheit für Feedback und Teamfähigkeit hatten einen echten Einfluss. Ich kann Burkay für jede zukünftige Frontend-Position wärmstens empfehlen – er hat großes Potenzial.",
    "testimonialPerson5": "Mehmet Emir Akbay",
    "testimonialTitle5": "User Interface Engineer – IOTech",
    "testimonialLink5": "https://www.linkedin.com/in/mehmet-emir-akbay-0ab251132/"
  },
  "getInTouch": {
    "pageTitle": "Kontakt aufnehmen",
    "pageContent": "Wie geht's weiter? Du kannst dich gerne bei mir melden – ob du einen Entwickler suchst, eine Frage hast oder einfach in Kontakt treten möchtest.",
    "text": "Du findest mich auch auf diesen Plattformen!"
  },
  "footer": {
    "footerText": "Diese Website wurde von Burkay entwickelt"
  }
}
