{
  "localization": {
    "currentLanguage": "EN"
  },
  "header": {
    "cv": "./EN-Burkay.pdf",
    "about": "About",
    "work": "Work",
    "testimonials": "Testimonials",
    "contact": "Contact",
    "lightMode": "Light Mode",
    "darkMode": "Dark Mode",
    "language": "Language",
    "download-cv": "Download CV",
    "download-cv-mobile": "CV",
    "close": "Close"
  },
  "introduction": {
    "title": "Hi, I'm Burkay 👋",
    "text": "Soon-to-be Electrical and Electronics Engineering graduate with internship experience in both game development and industrial software. Proficient in modern frontend technologies including JavaScript, TypeScript, React, Next.js, and Tailwind, with additional experience in C# and Unity. Adaptable and fast-learning, I’m seeking a junior software engineering position—primarily in frontend development—where I can contribute to impactful projects while continuing to grow as a developer.",
    "location": "Eskişehir, Turkey",
    "availability": "Available for opportunities"
  },
  "aboutMe": {
    "pageTitle": "About Me",
    "title": "Curious about me? Here you have it:",

    "text1": "I'm an aspiring software engineer with a background in Electrical and Electronics Engineering, graduating in just a month. My journey into tech began with a passion for games and evolved through hands-on experience at a video game studio and a SCADA software company. That mix taught me to think creatively while building reliable systems—and I loved every second of it.",
    "text2": "I specialize in frontend development using React, Next.js, TypeScript, and Tailwind CSS. I’ve also dabbled in Unity and C#, which gives me an eye for design and interactivity. I'm deeply interested in creating smooth, accessible, and well-structured digital experiences that users actually enjoy.",
    "text3": "I’m a fast learner, always curious, and not afraid to dive into new stacks or work across the full product lifecycle—from brainstorm to deploy. Whether I’m building components, fixing bugs, or learning about some obscure corner of the web, I’m all in.",
    "text4": "When I'm not coding, I'm either tweaking Cities: Skylines layouts, watching game dev breakdowns, or keeping up with the latest in frontend trends. You’ll probably find me lurking on GitHub or saving design inspo I’ll definitely use “soon”.",

    "li1": "Almost-graduate in Electrical & Electronics Engineering",
    "li2": "Two internships: game dev + industrial software",
    "li3": "Looking for junior frontend roles (but open to surprises)",
    "li4": "Open to freelance and full-time opportunities",

    "text5": "Let’s connect! I’d love to hear about what you're working on—or how I can help bring your next project to life. 😉"
  },
  "skills": {
    "pageTitle": "Skills",
    "pageContent": "The skills, tools and technologies I use:"
  },
  "experience": {
    "pageTitle": "Experience",
    "pageContent": "Here is a quick summary of my experiences:",

    "iotech title": "Frontend Developer",
    "iotech organization": "IOTech Software",
    "iotech li1": "I developed modules for component visualization in a widely used web SCADA software.",
    "iotech li2": "I developed various R&D projects using modern technologies such as Next.js, TypeScript, Zustand, and Auth.js.",
    "iotech date": "Feb 2025 - Present",

    "devnet title": "Game Developer Intern",
    "devnet organization": "Devnet Technology",
    "devnet li1": "I developed games for Android platforms using Unity and C# in genres such as Roguelike Shooter and Hypercasual.",
    "devnet date": "Jul 2024 - Sep 2024",

    "rgr title": "Marketing and Sponsorship Coordinator",
    "rgr organization": "Konya Technical University Red Giant Rover Team",
    "rgr li1": "We achieved third place in 2021 at the European Rover Challenge, one of Europe’s most prestigious robotics competitions.",
    "rgr li2": "Managed promotion and sponsorship activities and contributed to the preparation of reports and documents for competitions.",
    "rgr li3": "As a member of a highly professional team, I significantly improved my collaborative teamwork skills.",
    "rgr date": "Feb 2021 - Sep 2023",

    "gikat title": "Board Member and Vice President",
    "gikat organization": "Selcuk University Entrepreneurship and Career Club",
    "gikat li1": "Led successful projects in R&D, marketing, and organization fields",
    "gikat li2": "Negotiated business agreements with companies such as Atiker, Altınyıldız, and QNB Finansbank.",
    "gikat li3": "Designed and managed large-scale events with 1000 participants as well as smaller events with 50 participants.",
    "gikat date": "Oct 2021 - Jan 2023"
  },
  "work": {
    "pageTitle": "Work",
    "pageContent": "Some of the noteworthy projects I have built:",

    "workTitle1": "Golet E-Commerce Platform",
    "workText1": "As a graduation project, I contributed to the development of a Firebase-based e-commerce platform, compatible with both web and mobile, using React and Kotlin. This platform combines elements of Amazon and Letgo",

    "workTitle2": "Web SCADA Component Visualization",
    "workText2": "I developed a web SCADA module that combines and properly visualizes the general component information files from desktop SCADA software and real-time data received from the server via SignalR, after organizing and making them usable.",

    "workTitle3": "Game Development with Unity",
    "workText3": "I developed games for Android platforms using Unity and C# in genres such as Roguelike Shooter and Hypercasual. One of them is Treasure Wizard inspired by Vampire Survivors"
  },
  "testimonials": {
    "pageTitle": "Testimonials",
    "pageContent": "Nice things people have said about me:",

    "testimonialText1": "“As a self-motivated, solution-oriented individual with strong communication skills, I believe they will achieve great success in the field of software in the future. It was a pleasure working with them, and I wish them success in their career”",
    "testimonialPerson1": "Hamza Barış Doğan",
    "testimonialTitle1": "Senior Engineer - IOTech",
    "testimonialLink1": "https://www.linkedin.com/in/hamza-barış-doğan-410922165/",

    
    "testimonialText2": "“Thanks to his entrepreneurial spirit, project-oriented work discipline, and interest in technologies, he has made a difference during his student life. As his academic advisor, I wholeheartedly recommend him.”",
    "testimonialPerson2": "Hasan Erdinç Koçer",
    "testimonialTitle2": "Dean of the Faculty of Technology, Selçuk University",
    "testimonialLink2": "https://www.linkedin.com/in/hasan-erdinc-kocer-43884533/",

    "testimonialText3": "“Great guy, highly recommended for any COMPLEX front-end development job! His skills are top-notch and he will be an amazing addition to any team.”",
    "testimonialPerson3": "Burak Kılıç",
    "testimonialTitle3": "Frontend Developer - IOTech",
    "testimonialLink3": "https://www.linkedin.com/in/burakkilic2/",

    "testimonialText4": "“Working with Burkay was a pleasure. They have a rare ability to think system-wide, understanding how each piece fits into the bigger picture. Burkay also consistently impressed me with their thorough research and problem-solving skills, making thoughtful, well-informed contributions. They would be a strong asset to any team.”",
    "testimonialPerson4": "Abdurahmaan Yuusuf",
    "testimonialTitle4": "R&D Team Leader - IOTech",
    "testimonialLink4": "https://www.linkedin.com/in/abdurahmaan-yuusuf-6512a8321/",

    "testimonialText5": "“Burkay was a fantastic addition to our team during his internship. He quickly picked up our tech stack, delivered clean and reliable code, and showed strong problem-solving skills. His positive attitude, responsiveness to feedback, and teamwork made a real impact. I highly recommend Burkay for any future frontend role—he have great potential.”",
    "testimonialPerson5": "Mehmet Emir Akbay",
    "testimonialTitle5": "User Interface Engineer - IOTech",
    "testimonialLink5": "https://www.linkedin.com/in/mehmet-emir-akbay-0ab251132/"
  },
  "getInTouch": {
    "pageTitle": "Get in touch",
    "pageContent": "What's next? Feel free to reach out to me if you're looking for a developer, have a query, or simply want to connect.",
    "text": "You may also find me on these platforms!"
  },
  "footer": {
    "footerText": "This site was developed by Burkay"
  }
}

